; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob74) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 distributor0)
	(clear crate6)
	(at pallet2 distributor1)
	(clear crate7)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 431)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 258)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 92)
	(at crate1 distributor0)
	(on crate1 crate0)
	(= (weight crate1) 43)
	(at crate2 distributor0)
	(on crate2 crate1)
	(= (weight crate2) 75)
	(at crate3 distributor1)
	(on crate3 pallet2)
	(= (weight crate3) 98)
	(at crate4 distributor1)
	(on crate4 crate3)
	(= (weight crate4) 65)
	(at crate5 depot0)
	(on crate5 pallet0)
	(= (weight crate5) 91)
	(at crate6 distributor0)
	(on crate6 crate2)
	(= (weight crate6) 16)
	(at crate7 distributor1)
	(on crate7 crate4)
	(= (weight crate7) 4)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate1 pallet1)
		(on crate2 pallet2)
		(on crate4 crate5)
		(on crate5 pallet0)
		(on crate6 crate1)
		(on crate7 crate2)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate7 crate4 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate4)
   added: (lifting hoist2 crate7) (clear crate4)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 6
2. (load hoist2 crate7 truck0 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 4
   goals met: 1 of 6
3. (lift hoist2 crate4 crate3 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate3)
   added: (lifting hoist2 crate4) (clear crate3)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 6
4. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 4 to 69
   goals met: 1 of 6
5. (lift hoist1 crate6 crate2 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate2)
   added: (lifting hoist1 crate6) (clear crate2)
   changed: (fuel-cost) from 2 to 3
   goals met: 1 of 6
6. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 3 to 13
   goals met: 1 of 6
7. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 69 to 4
   goals met: 1 of 6
8. (drop hoist0 crate4 crate5 depot0)
   deleted: (lifting hoist0 crate4) (clear crate5)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate5)
   goals met: 2 of 6
9. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 2 of 6
10. (lift hoist2 crate3 pallet2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 pallet2)
   added: (lifting hoist2 crate3) (clear pallet2)
   changed: (fuel-cost) from 23 to 24
   goals met: 2 of 6
11. (drop hoist1 crate6 crate2 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate2)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate2)
   goals met: 2 of 6
12. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 4 to 102
   goals met: 2 of 6
13. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 24 to 34
   goals met: 2 of 6
14. (lift hoist1 crate6 crate2 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate2)
   added: (lifting hoist1 crate6) (clear crate2)
   changed: (fuel-cost) from 34 to 35
   goals met: 2 of 6
15. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 102 to 118
   goals met: 2 of 6
16. (lift hoist1 crate2 crate1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate1)
   added: (lifting hoist1 crate2) (clear crate1)
   changed: (fuel-cost) from 35 to 36
   goals met: 2 of 6
17. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 118 to 193
   goals met: 2 of 6
18. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 36 to 46
   goals met: 2 of 6
19. (unload hoist2 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist2)
   added: (lifting hoist2 crate2)
   changed: (current_load truck0) from 193 to 118
   goals met: 2 of 6
20. (drop hoist2 crate2 pallet2 distributor1)
   deleted: (lifting hoist2 crate2) (clear pallet2)
   added: (available hoist2) (at crate2 distributor1) (clear crate2) (on crate2 pallet2)
   goals met: 3 of 6
21. (unload hoist2 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck0) from 118 to 114
   goals met: 3 of 6
22. (drop hoist2 crate7 crate2 distributor1)
   deleted: (lifting hoist2 crate7) (clear crate2)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 crate2)
   goals met: 4 of 6
23. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 46 to 56
   goals met: 4 of 6
24. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   changed: (fuel-cost) from 56 to 57
   goals met: 4 of 6
25. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 114 to 157
   goals met: 4 of 6
26. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 57 to 58
   goals met: 4 of 6
27. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 157 to 249
   goals met: 4 of 6
28. (unload hoist1 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck0) from 249 to 206
   goals met: 4 of 6
29. (drop hoist1 crate1 pallet1 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 pallet1)
   goals met: 5 of 6
30. (unload hoist1 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck0) from 206 to 190
   goals met: 5 of 6
31. (drop hoist1 crate6 crate1 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate1)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate1)
   goals met: 6 of 6
